src/DataProcessors/Температура/Температура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Температура</name>
  <attributes>
    <name>НаселенныйПункт</name>
    <type>
      <types>CatalogRef.НаселенныеПункты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/Температура/Forms/Форма/Module.bsl
&НаСервере
Процедура ОбновитьПогодуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Температура = СервисыПогоды.ВернутьТемпературу(ОбработкаОбъект.НаселенныйПункт, ОбработкаОбъект.Сервис);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Показатели;
	//СтруктураНаименованияНаселенногоПункта = СервисыПогоды.ЗначенияРеквизитовОбъекта(Объект.НаселенныйПункт, "Наименование");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПогоду(Команда)
	
	ОбновитьПогодуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НаселенныйПункт = ПредопределенноеЗначение("Справочник.НаселенныеПункты.Москва");
	Объект.Сервис = ПредопределенноеЗначение("Справочник.Сервисы.OpenWeather");
	ОбновитьПогодуНаСервере();

КонецПроцедуры
